alibaba/AliOS-Things/platform/mcu/atsaml21/saml21b/atdf/ATSAML21J17B.atdf
        <module name="MCLK" id="U2234" version="1.0.1">
          <instance name="MCLK">
            <register-group name="MCLK" name-in-module="MCLK" address-space="base" offset="0x40000400"/>
            <parameters>
              <param name="CTRLA_MCSEL_GCLK" value="1"/>
              <param name="CTRLA_MCSEL_OSC8M" value="0"/>
              <param name="MCLK_CLK_APB_NUM" value="5"/>
              <param name="SYSTEM_CLOCK" value="4000000"/>
              <param name="INSTANCE_ID" value="1"/>
            </parameters>
            <clock-groups>
              <clock-group name="AHB" grouporder="0">
                <clock name="HPB0" bit="0"/>
                <clock name="HPB1" bit="1"/>
                <clock name="HPB2" bit="2"/>
                <clock name="HPB3" bit="3"/>
                <clock name="HPB4" bit="4"/>
                <clock name="DSU" bit="5"/>
                <clock name="NVMCTRL" bit="8"/>
                <clock name="HSRAM" bit="9"/>
                <clock name="LPRAM" bit="10"/>
                <clock name="DMAC" bit="11"/>
                <clock name="USB" bit="12"/>
                <clock name="PAC" bit="14"/>
                <clock name="NVMCTRL_PICACHU" bit="15"/>
                <clock name="L2HBRIDGES_H" bit="16"/>
                <clock name="H2LBRIDGES_H" bit="17"/>
                <clock name="HSRAM_AHBSETUPKEEPER" bit="18"/>
                <clock name="HSRAM_HMATRIXLP2HMCRAMCHSBRIDGE" bit="19"/>
              </clock-group>
            </clock-groups>
          </instance>
        </module>
        <module name="MTB" id="U2002" version="1.0.0">
          <instance name="MTB">
            <register-group name="MTB" name-in-module="MTB" address-space="base" offset="0x41006000"/>
            <parameters>
              <param name="INSTANCE_ID" value="35"/>
            </parameters>
          </instance>
        </module>
        <module name="NVMCTRL" id="U2207" version="3.0.2">
          <instance name="NVMCTRL">
            <register-group name="NVMCTRL" name-in-module="NVMCTRL" address-space="base" offset="0x41004000"/>
            <parameters>
              <param name="FACTORY_WORD_IMPLEMENTED_MASK" value="0XC0000007FFFFFFFF"/>
              <param name="GCLK_ID" value="35"/>
              <param name="PMSB" value="3"/>
              <param name="PSZ_BITS" value="6"/>
              <param name="USER_PAGE_OFFSET" value="0x00800000"/>
              <param name="USER_WORD_IMPLEMENTED_MASK" value="0XC01FFFFFFFFFFFFF"/>
              <param name="RWWEE_PAGES" value="128"/>
              <param name="RWW_EEPROM_ADDR" value="0x00400000"/>
              <param name="RWW_EEPROM_SIZE" value="4096"/>
              <param name="FLASH_SIZE" value="131072"/>
              <param name="PAGE_SIZE" value="64"/>
              <param name="PAGES" value="2048"/>
              <param name="PAGES_PR_REGION" value="128"/>
                  <!--  From Datasheet section "Electrical Characteristics","Flash Characteristics" table "Maximum operating Frequency" -->
                  <param name="PSM_0_FRMFW_FWS_1_MAX_FREQ" value="12000000"/>
                  <param name="PSM_0_FRMLP_FWS_0_MAX_FREQ" value="18000000"/>
                  <param name="PSM_0_FRMLP_FWS_1_MAX_FREQ" value="36000000"/>
                  <param name="PSM_0_FRMHS_FWS_0_MAX_FREQ" value="25000000"/>
                  <param name="PSM_0_FRMHS_FWS_1_MAX_FREQ" value="50000000"/>
                  <param name="PSM_1_FRMFW_FWS_1_MAX_FREQ" value="12000000"/>
                  <param name="PSM_1_FRMLP_FWS_0_MAX_FREQ" value="8000000"/>
                  <param name="PSM_1_FRMLP_FWS_1_MAX_FREQ" value="12000000"/>
              <param name="INSTANCE_ID" value="34"/>
            </parameters>
          </instance>
        </module>
        <module name="FUSES" id="U2207" version="3.0.2">
          <instance name="FUSES">
            <register-group name="OTP5_FUSES" name-in-module="OTP5_FUSES" address-space="fuses" offset="0x00806020"/>
            <register-group name="TEMP_LOG_FUSES" name-in-module="TEMP_LOG_FUSES" address-space="fuses" offset="0x00806030"/>
            <register-group name="USER_FUSES" name-in-module="USER_FUSES" address-space="fuses" offset="0x00804000"/>
          </instance>
        </module>
        <module name="OPAMP" id="U2237" version="1.1.0">
          <instance name="OPAMP">
            <register-group name="OPAMP" name-in-module="OPAMP" address-space="base" offset="0x43001800"/>
            <signals>
              <signal group="OANEG" index="0" function="B_OPAMP" pad="PA02"/>
              <signal group="OANEG" index="1" function="B_OPAMP" pad="PB05"/>
              <signal group="OANEG" index="2" function="B_OPAMP" pad="PB06"/>
              <signal group="OAOUT" index="0" function="B_OPAMP" pad="PA07"/>
              <signal group="OAOUT" index="1" function="B_OPAMP" pad="PB08"/>
              <signal group="OAOUT" index="2" function="B_OPAMP" pad="PA04"/>
              <signal group="OAPOS" index="0" function="B_OPAMP" pad="PA06"/>
              <signal group="OAPOS" index="1" function="B_OPAMP" pad="PB09"/>
              <signal group="OAPOS" index="2" function="B_OPAMP" pad="PA05"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="102"/>
            </parameters>
          </instance>
        </module>
        <module name="OSCCTRL" id="U2119" version="1.1.0">
          <instance name="OSCCTRL">
            <register-group name="OSCCTRL" name-in-module="OSCCTRL" address-space="base" offset="0x40000C00"/>
            <signals>
              <signal group="XIN" function="XIN" pad="PA14"/>
              <signal group="XOUT" function="XOUT" pad="PA15"/>
            </signals>
            <parameters>
              <param name="DFLL48M_COARSE_MSB" value="5"/>
              <param name="DFLL48M_FINE_MSB" value="9"/>
              <param name="GCLK_ID_DFLL48" value="0"/>
              <param name="GCLK_ID_FDPLL" value="1"/>
              <param name="GCLK_ID_FDPLL32K" value="2"/>
              <param name="DFLL48M_VERSION" value="0x320"/>
              <param name="FDPLL_VERSION" value="0x200"/>
              <param name="OSC16M_VERSION" value="0x100"/>
              <param name="XOSC_VERSION" value="0x120"/>
              <param name="INSTANCE_ID" value="3"/>
            </parameters>
          </instance>
        </module>
        <module name="OSC32KCTRL" id="U2246" version="1.1.0">
          <instance name="OSC32KCTRL">
            <register-group name="OSC32KCTRL" name-in-module="OSC32KCTRL" address-space="base" offset="0x40001000"/>
            <signals>
              <signal group="XIN32" function="XIN32" pad="PA00"/>
              <signal group="XOUT32" function="XOUT32" pad="PA01"/>
            </signals>
            <parameters>
              <param name="OSC32K_COARSE_CALIB_MSB" value="6"/>
              <param name="INSTANCE_ID" value="4"/>
            </parameters>
          </instance>
        </module>
        <module name="PAC" id="U2120" version="1.1.0">
          <instance name="PAC">
            <register-group name="PAC" name-in-module="PAC" address-space="base" offset="0x44000000"/>
            <parameters>
              <param name="HPB_NUM" value="5"/>
              <param name="INTFLAG_NUM" value="6"/>
              <param name="INSTANCE_ID" value="128"/>
            </parameters>
          </instance>
        </module>
        <module name="PM" id="U2240" version="1.0.2">
          <instance name="PM">
            <register-group name="PM" name-in-module="PM" address-space="base" offset="0x40000000"/>
            <signals>
              <signal group="RESET_N" function="default" pad="RESET_N"/>
            </signals>
            <parameters>
              <param name="PD_NUM" value="3"/>
              <param name="INSTANCE_ID" value="0"/>
            </parameters>
          </instance>
        </module>
